package day07;

public class Step3 {
    public static void main(String[] args) {
        
        // 여러개 자료를 관리하는 방법
            // 이름이 '유재석'이고 전화번호가 '010-3333-3333' 나이 '53' 일 때.
        // 1. 변수
        String 이름 = "유재석";
        String 전화번호 = "010-3333-3333";
        int 나이 = 53;
            // 단점 : 인원이 증가하면 그 인원수 만큼의 X3의 만큼의 변수 필요.
        // 2. 배열
        String[] 이름명단 = {"유재석"};
        String[] 전화번호명단 = {"010-3333-3333"};
        int[] 나이명단 = {53};
            // 주의 할 점 : 동일한 타입의 데이터들만 나열할 수 있다.
        //또는
        String[] 명단 = {
                "유재석", "010-3333-3333", "53",
                "강호동", "010-4444-3333", "73"
        };
        // 이렇게 쓰면 인덱스 관리가 힘들어진다.
        // 3. 문자열
        String 인원 = "유재석,010-3333-3333,53";
        String[] 인원명단 = {인원, 인원};
        // vs 여러개의 자료들을 하나의 문자열로 합치기 [!!! : 구분자]
        String 인원2 = "유재석,010-3333-3333,53\n강호동,010-4444-3333,73";
            //1. 사람구분 : \n
            //2. 사람마다의 정보 : , 근데 갑자기 010-33,33 이렇게 누가 입력해버리면 큰일난다.

        // 4. 클래스 / 객체
                // 서로 다른 타입들을 하나의 타입으로 묶으려고, 표현하려고!!★ .으로 접근연산자 쓰려고!
            // class 사람 { String String int }

            // 사람 m = new 사람();
            // 사람 m = new 사람();
            // 사람[] 인원명단 = {m{ String String int },m{ String String int }}






        
    }
}
